cask_args appdir: "/Applications"

# ==OS==
brew "m-cli"              # https://formulae.brew.sh/formula/m-cli    # Mac便利ツール
brew "mas"                # https://formulae.brew.sh/formula/mas      # Mac App Store操作用ツール
brew "bluetoothconnector" # https://formulae.brew.sh/formula/bluetoothconnector #

# ==ターミナル==
brew "zsh"                # https://formulae.brew.sh/formula/zsh      #
brew "tmux"               # https://formulae.brew.sh/formula/tmux     #
brew "reattach-to-user-namespace" # https://formulae.brew.sh/formula/reattach-to-user-namespace # tmux便利ツール
brew "zplug"              # https://formulae.brew.sh/formula/zplug    # ターミナル用プラグイン管理
brew "peco"               # https://formulae.brew.sh/formula/peco     # インクリメンタルサーチ
brew "fzf"                # https://formulae.brew.sh/formula/fzf      # ファジー検索
brew "fpp"                # https://formulae.brew.sh/formula/fpp      # パスピッカー
brew "ag"                 # https://formulae.brew.sh/formula/the_silver_searcher      # 超すごいgrep
brew "pt"                 # https://formulae.brew.sh/formula/the_platinum_searcher    # 超すごいgrep
brew "rg"                 # https://formulae.brew.sh/formula/ripgrep                  # 超すごいgrep
brew "exa"                # https://formulae.brew.sh/formula/exa      # すごいls
brew "bat"                # https://formulae.brew.sh/formula/bat      # すごいcat
brew "hexyl"              # https://formulae.brew.sh/formula/hexyl    # すごいod
brew "fd"                 # https://formulae.brew.sh/formula/fd       # すごいfind
brew "htop"               # https://formulae.brew.sh/formula/htop     # プロセスビューワ
brew "bandwhich"          # https://formulae.brew.sh/formula/bandwhich    # 帯域確認
brew "vim"                # https://formulae.brew.sh/formula/vim      #
brew "tree"               # https://formulae.brew.sh/formula/tree     # ディレクトリツリー表示
brew "procs"              # https://formulae.brew.sh/formula/procs    # すごいps
brew "pstree"             # https://formulae.brew.sh/formula/pstree   # psをツリーで表示
brew "emojify"            # https://formulae.brew.sh/formula/emojify  # 絵文字
brew "youtube-dl"         # https://formulae.brew.sh/formula/youtube-dl   # YouTube動画DLツール
brew "Code-Hex/pget/pget" # https://github.com/Code-Hex/pget          # 高速DLツール
brew "knqyf263/pet/pet"   # https://github.com/knqyf263/pet           # スニペットマネージャ
brew "homebrew/cask-fonts/font-meslo-for-powerline"

# ==ウェブ開発==
brew "direnv"             # https://formulae.brew.sh/formula/direnv   #
brew "devd"               # https://formulae.brew.sh/formula/devd     # ローカルサーバ
brew "git"                # https://formulae.brew.sh/formula/git      # git
brew "hub"                # https://formulae.brew.sh/formula/hub      # GitHubサポートツール
brew "ghq"                # https://formulae.brew.sh/formula/ghq      # git clone便利ツール
brew "gh"                 # https://formulae.brew.sh/formula/gh       # GitHubコマンドラインツール
brew "tig"                # https://formulae.brew.sh/formula/tig      # gitクライアント
brew "lazygit"            # https://formulae.brew.sh/formula/lazygit  # gitクライアント
brew "gibo"               # https://formulae.brew.sh/formula/gibo     # gitignoreボイラープレート
brew "yarn"               # https://formulae.brew.sh/formula/yarn     # パッケージ管理
brew "ctop"               # https://formulae.brew.sh/formula/ctop     # dockerコンテナメトリクスビューワ
brew "dry"                # https://moncho.github.io/dry/             # dockerマネージャ
brew "jq"                 # https://formulae.brew.sh/formula/jq       # json便利ツール
brew "mycli"              # https://formulae.brew.sh/formula/mycli    # MySQL便利ツール
brew "wget"               # https://formulae.brew.sh/formula/wget     # DLツール
brew "httpie"             # https://formulae.brew.sh/formula/httpie   # 高機能cURL
brew "httpstat"           # https://formulae.brew.sh/formula/httpstat # cURLの統計情報表示
brew "speedtest_cli"      # https://github.com/sivel/speedtest-cli    # スピードテストツール
brew "netlify-cli"        # https://formulae.brew.sh/formula/netlify-cli  # Netlify

# ==Python==
brew "pipenv"             # https://formulae.brew.sh/formula/pipenv   # Pythonマネージャ

# ==画像処理==
brew "ImageMagick"        # https://formulae.brew.sh/formula/ImageMagick #
brew "svgo"               # https://formulae.brew.sh/formula/svgo     #
brew "webp"               # https://formulae.brew.sh/formula/webp     #
#brew --use-clang --HEAD ffmpeg --with-faac --with-fdk-aac --with-ffplay --with-fontconfig --with-freetype --with-frei0r --with-libass --with-libbluray --with-libcaca --with-libquvi --with-libsoxr --with-libvidstab --with-libvorbis --with-libvpx --with-opencore-amr --with-openjpeg --with-openssl --with-opus --with-rtmpdump --with-speex --with-theora --with-tools --with-x265 --enable-libx264 --enable-gpl --enable-libxvid --enable-shared

# ==aws==
brew "awscli"
brew "aws/tap/aws-sam-cli"

# ==heroku==
brew "heroku/brew/heroku"

# ==Dockerをインストール==
cask "docker"

# ==各GUIツールをインストール==
cask "1password"
cask "adobe-creative-cloud"
cask "alfred"
cask "appcleaner"
cask "blender"
cask "charles"
cask "daisydisk"
cask "dash"
cask "discord"
cask "dropbox"
cask "firefox"
cask "fork"
cask "glyphs"
cask "google-backup-and-sync"
cask "google-chrome"
cask "hiddenbar"
cask "hyperswitch"
cask "iconjar"
cask "imagealpha"
cask "imageoptim"
cask "iterm2"
cask "jetbrains-toolbox"
cask "karabiner-elements"
cask "ksdiff"
cask "keyboard-maestro"
cask "magicalvoxel"
cask "monitorcontrol"
cask "onyx"
cask "openframeworks"
cask "paw"
cask "pngyu"
cask "processing"
cask "p5"
cask "qlcolorcode qlstephen qlmarkdown quicklook-json qlprettypatch quicklook-csv betterzipql qlimagesize webpquicklook suspicious-package"
cask "rightfont"
cask "skyfonts"
cask "slack"
cask "sonic-pi"
cask "sourcetree"
#cask "spotify"
#cask "steam"
cask "svgcleaner"
cask "touchdesigner"
cask "transmit"
cask "the-unarchiver"
cask "unity-hub"
cask "vlc"
cask "visual-studio-code"
cask "webponize"
cask "xld"
mas "Keynote",              id: 409183694
mas "Pages",                id: 409201541
mas "Numbers",              id: 409203825
mas "Xcode",                id: 497799835
mas "JPEGmini",             id: 498944723
mas "LINE",                 id: 539883307
mas "Kaleidoscope",         id: 587512244
mas "Affinity Designer",    id: 824171161
mas "CotEditor",            id: 1024640650
mas "Lungo",                id: 1263070803
mas "Gifski",               id: 1351639930
mas "Reeder",               id: 1449412482
