cask_args appdir: "/Applications"

# === OS ===
brew "m-cli"              # https://formulae.brew.sh/formula/m-cli            # Mac便利ツール
brew "mas"                # https://formulae.brew.sh/formula/mas              # Mac App Store操作用ツール

# === tmux ===
brew "tmux"               # https://formulae.brew.sh/formula/tmux             # ターミナルマルチプレクサ
brew "tpm"                # https://formulae.brew.sh/formula/tpm              # tmuxプラグインマネージャ

# === ターミナル ===
brew "ag"                 # https://formulae.brew.sh/formula/the_silver_searcher    # 超すごいgrep
brew "fpp"                # https://formulae.brew.sh/formula/fpp              # パスピッカー
brew "fzf"                # https://formulae.brew.sh/formula/fzf              # ファジー検索
brew "navi"               # https://formulae.brew.sh/formula/navi             # コマンドラインチュートリアルツール
brew "nkf"                # https://formulae.brew.sh/formula/nkf              # 文字コード変換ツール
brew "pstree"             # https://formulae.brew.sh/formula/pstree           # psをツリーで表示
brew "pt"                 # https://formulae.brew.sh/formula/the_platinum_searcher  # 超すごいgrep
brew "sheldon"            # https://formulae.brew.sh/formula/sheldon          # 高速zshプラグイン管理（Rust製）
brew "starship"           # https://formulae.brew.sh/formula/starship         # すごいプロンプト表示
brew "tailspin"           # https://formulae.brew.sh/formula/tailspin         # 高性能tailコマンド
brew "tree"               # https://formulae.brew.sh/formula/tree             # ディレクトリツリー表示

# === システムモニタ ===
brew "btop"               # https://formulae.brew.sh/formula/btop             # プロセスビューワ
brew "htop"               # https://formulae.brew.sh/formula/htop             # プロセスビューワ
brew "mactop"             # https://formulae.brew.sh/formula/mactop           # プロセスビューワ
brew "zenith"             # https://formulae.brew.sh/formula/zenith           # ターミナルシステムモニタ

# === 開発一般 ===
brew "colima"             # https://formulae.brew.sh/formula/colima           # 軽量Dockerランタイム（Docker Desktop代替）
brew "direnv"             # https://formulae.brew.sh/formula/direnv           # ディレクトリ毎環境変数管理ツール
brew "docker"             # https://formulae.brew.sh/formula/docker           # コンテナ管理CLI
brew "docker-compose"     # https://formulae.brew.sh/formula/docker-compose   # 複数コンテナ管理
brew "mise"               # https://formulae.brew.sh/formula/mise             # タスクランナー
brew "shubh-io/tap/dockmate" # https://github.com/shubh-io/dockmate           # Docker管理ツール
brew "vim"                # https://formulae.brew.sh/formula/vim              # テキストエディタ
brew "wget"               # https://formulae.brew.sh/formula/wget             # DLツール

# === formatter/linter ===
brew "markdownlint-cli"   # https://formulae.brew.sh/formula/markdownlint-cli # Markdownリンター
brew "pre-commit"         # https://formulae.brew.sh/formula/pre-commit       # Gitフック管理ツール
brew "shellcheck"         # https://formulae.brew.sh/formula/shellcheck       # シェルスクリプトリンター
brew "shfmt"              # https://formulae.brew.sh/formula/shfmt            # シェルスクリプトフォーマッター
brew "yamllint"           # https://formulae.brew.sh/formula/yamllint         # YAMLリンター

# === gitクライアント ===
brew "gitui"              # https://formulae.brew.sh/formula/gitui            # gitクライアント
brew "git-delta"          # https://formulae.brew.sh/formula/git-delta        # gitクライアント
brew "lazygit"            # https://formulae.brew.sh/formula/lazygit          # gitクライアント
brew "tig"                # https://formulae.brew.sh/formula/tig              # gitクライアント

# === git補助ツール ===
brew "czg"                # https://formulae.brew.sh/formula/czg              # コミットメッセージ支援ツール
brew "diff-so-fancy"      # https://formulae.brew.sh/formula/diff-so-fancy    # git diff見やすくするツール
brew "gh"                 # https://formulae.brew.sh/formula/gh               # GitHubコマンドラインツール
brew "ghq"                # https://formulae.brew.sh/formula/ghq              # git clone便利ツール
brew "gibo"               # https://formulae.brew.sh/formula/gibo             # gitignoreボイラープレート
brew "git"                # https://formulae.brew.sh/formula/git              # git
brew "git-delta"          # https://formulae.brew.sh/formula/git-delta        # git diff見やすくするツール
brew "hub"                # https://formulae.brew.sh/formula/hub              # GitHubサポートツール
brew "satococoa/tap/wtp"  # https://github.com/satococoa/wtp                  # GitHub Worktree Plus

# === ウェブ開発 ===
brew "dstp"               # https://formulae.brew.sh/formula/dstp             # ネットワーク調査
brew "httpstat"           # https://formulae.brew.sh/formula/httpstat         # cURLの統計情報表示
brew "http-server"        # https://formulae.brew.sh/formula/http-server      # ローカルサーバ
brew "jq"                 # https://formulae.brew.sh/formula/jq               # json便利ツール
brew "mycli"              # https://formulae.brew.sh/formula/mycli            # MySQL便利ツール
brew "speedtest-cli"      # https://formulae.brew.sh/formula/speedtest-cli    # スピードテストツール
brew "xh"                 # https://formulae.brew.sh/formula/xh               # HTTPクライアント
# brew "productdevbook/tap/pk"  #https://github.com/productdevbook/port-killer/issues/48  # ポート解放ツール

# === Saas ===
brew "awscli"             # https://formulae.brew.sh/formula/awscli           # AWSコマンドラインツール
brew "firebase-cli"       # https://formulae.brew.sh/formula/firebase-cli     # Firebaseコマンドラインツール
brew "heroku"             # https://formulae.brew.sh/formula/heroku           # Herokuコマンドラインツール
brew "netlify-cli"        # https://formulae.brew.sh/formula/netlify-cli      # Netlifyコマンドラインツール
brew "vercel-cli"         # https://formulae.brew.sh/formula/vercel-cli       # Vercelコマンドラインツール

# === Python ===
brew "uv"                 # https://formulae.brew.sh/formula/uv               # Python環境管理ツール
# brew "pipenv"           # https://formulae.brew.sh/formula/pipenv           # Pythonマネージャ

# === 画像処理 ===
brew "ffmpeg"             # https://formulae.brew.sh/formula/ffmpeg           # 動画処理ツール
brew "imageoptim-cli"     # https://formulae.brew.sh/formula/imageoptim-cli   # 画像最適化ツール
brew "ImageMagick"        # https://formulae.brew.sh/formula/ImageMagick      # 画像処理ツール
brew "svgo"               # https://formulae.brew.sh/formula/svgo             # SVG最適化ツール
brew "webp"               # https://formulae.brew.sh/formula/webp             # WebP画像処理ツール
brew "libavif"            # https://formulae.brew.sh/formula/libavif          # AVIF画像処理ツール

# === AI ===
#tap "dagger/tap"
#brew "dagger/tap/container-use"
brew "specify"            # https://formulae.brew.sh/formula/specify          # Spec-Driven Developmentツール
# brew "asheshgoplani/tap/agent-deck" # https://github.com/asheshgoplani/agent-deck  # マルチAIエージェント管理ツール

# === ユーティリティ ===
brew "emojify"            # https://formulae.brew.sh/formula/emojify          # 絵文字
brew "gnupg2"             # https://formulae.brew.sh/formula/gnupg            # 署名ツール
brew "pget"               # https://formulae.brew.sh/formula/pget             # 高速DLツール
brew "yt-dlp"             # https://formulae.brew.sh/formula/yt-dlp           # YouTube動画DLツール
brew "carlocab/personal/unrar" # https://formulae.brew.sh/formula/unrar       # RAR解凍ツール

# === ユーティリティ ===
#cask "1password"
#cask "1password-cli"
#cask "abyssoft-teleport"
#cask "aldente"
#cask "alfred"
#cask "amorphousdiskmark"
#cask "appcleaner"
#cask "app-tamer"
#cask "bartender"
#cask "bettertouchtool"
#cask "cursorsense"
#cask "cleanmymac"
#cask "daisydisk"
#cask "deeper"
#cask "dropbox"
#cask "google-drive"
#cask "hiddenbar"
#cask "hyperswitch"
#cask "karabiner-elements"
#cask "keyboard-maestro"
#cask "lzt1008/tap/powerflow"
#cask "mac-mouse-fix"
#cask "macwhisper"
#cask "macwinzipper"
#cask "monitorcontrol"
#cask "notion"
#cask "notion-calendar"
#cask "obsidian"
#cask "ogdesign-eagle"
#cask "onyx"
#cask "qlcolorcode qlstephen qlmarkdown quicklook-json qlprettypatch quicklook-csv betterzipql qlimagesize webpquicklook suspicious-package"
#cask "sensei"
#cask "smoothcsv"
#cask "spotify"
#cask "the-unarchiver"
#cask "transmission"
#tap "hmarr/tap"
#cask "vitals"
#cask "vpn-by-google-one"

# === AI ===
#cask "antigravity"
#cask "athas"
#cask "chatgpt"
#cask "claude"
#cask "claude-code"
#cask "coderabbit"
#cask "conductor"
#cask "cursor"
#cask "kiro"
#cask "osaurus"

# === エンタメ ===
#cask "alcom"
#cask "bluestacks"
#cask "steam"

# === コミュニケーション ===
#cask "discord"
#cask "messenger"
#cask "microsoft-teams"
#cask "slack"
#cask "zoom"

# === ブラウザ ===
#cask "arc"
#cask "brave-browser"
#cask "chatgpt-atlas"
#cask "firefox"
#cask "firefox-developer-edition"
#cask "firefox-nightly"
#cask "google-chrome"
#cask "google-chrome-beta"
#cask "google-chrome-canary"
#cask "google-chrome-dev"
#cask "microsoft-edge"
#cask "microsoft-edge-beta"
#cask "microsoft-edge-canary"
#cask "microsoft-edge-dev"
#cask "microsoft-office-2016"
#cask "thebrowsercompany-dia"
#cask "vivaldi"
#cask "zen"

# === 仮想環境 ===
#cask "mist"
#cask "parallels"
#cask "utm"

# === ターミナル ===
#cask "ghostty"
#cask "iterm2"
#cask "warp"

# === ウェブ開発 ===
#cask "charles"
#cask "contraste"
#cask "dash"
#cask "docker"
#cask "fork"
#cask "graphql-playground"
#cask "hex-fiend"
#cask "jasper-app"
#cask "jetbrains-toolbox"
#cask "ksdiff"
#cask "paw"
#cask "sourcetree"
#cask "tower"
#cask "transmit"
#cask "visual-studio-code"
#cask "xbar"

# === デザイン ===
#cask "adobe-creative-cloud"  # https://formulae.brew.sh/cask/adobe-creative-cloud  # Adobe Creative Cloud
#cask "affinity"              # https://formulae.brew.sh/cask/affinity         # Affinity製品群
#cask "drawio"                # https://formulae.brew.sh/cask/drawio           # 図作成ツール
#cask "figma"                 # https://formulae.brew.sh/cask/figma            # デザインツール
#cask "iconjar"               # https://formulae.brew.sh/cask/iconjar          # アイコン管理ツール

# === 画像処理 ===
#cask "optimage"
#cask "imagealpha"
#cask "imageoptim"
#cask "pngyu"
#cask "svgcleaner"

# === 音源処理 ===
#cask "blackhole-16ch"
#cask "eqMac"
#cask "xld"

# === 映像処理 ===
#cask "iina"
#cask "obs"
#cask "vlc"

# === フォントツール ===
#cask "fontbase"
#cask "fontgoggles"
#cask "glyphs"
#cask "fontexplorer-x-pro"
#cask "rightfont"
#cask "skyfonts"

# === デザイン用フォント ===
#cask "font-noto-sans-jp"
#cask "font-noto-serif-jp"

# === 開発用フォント ===
#cask "font-cascadia-code"
#cask "font-fira-code"
#cask "font-google-sans-code"
#cask "font-hackgen"
#cask "font-intel-one-mono"
#cask "font-jetbrains-mono"
#cask "font-meslo-for-powerline"
#cask "font-moralerspace"
#cask "font-plemol-jp"
#cask "font-source-han-code-jp"
cask "font-udev-gothic"

# === ターミナル用フォント ===
#cask "font-hackgen-nerd"
#cask "font-hack-nerd-font"

# === CreativeCoding ===
#cask "blender"
#cask "magicalvoxel"
#cask "openframeworks"
#cask "processing"
#cask "p5"
#cask "sonic-pi"
#cask "touchdesigner"
#cask "unity-hub"

# === mas ===
#mas "Kindle",                id: 302584613
#mas "Keynote",               id: 409183694
#mas "Pages",                 id: 409201541
#mas "Numbers",               id: 409203825
#mas "Magnet",                id: 441258766
#mas "PopClip",               id: 445189367
#mas "Bandwidth+",            id: 490461369
#mas "Xcode",                 id: 497799835
#mas "JPEGmini",              id: 498944723
#mas "LINE",                  id: 539883307
#mas "Kaleidoscope",          id: 587512244
#mas "Affinity Designer",     id: 824171161
#mas "CotEditor",             id: 1024640650
#mas "Lungo",                 id: 1263070803
#mas "Windows App",           id: 1295203466
#mas "Gifski",                id: 1351639930
#mas "TeraCopy",              id: 1378806557
#mas "辞書 by 物書堂",          id: 1380563956
#mas "Adblock Plus",          id: 1432731683
#mas "AdGuard for Safari",    id: 1440147259
#mas "Reeder",                id: 1449412482
#mas "ComicViewer",           id: 1455702185
#mas "ReelSteady"             id: 1460836908
#mas "Tailscale"              id: 1475387142
#mas "Vimari",                id: 1480933944
#mas "Cicero",                id: 1480977453
#mas "Structured",            id: 1499198946
#mas "1Password for Safari",  id: 1569813296
#mas "WebPonize",             id: 1526039365
#mas "Eagle for Safari",      id: 1526651672
#mas "Reeder",                id: 1529448980
#mas "Notion Web Clipper",    id: 1559269364
#mas "Kaleidoscope",          id: 1575557335
#mas "Whisper Transcription", id: 1668083311
